# St7GetNumSRACases

Returns the number of spectral Load Excitation and Base Excitation cases in the result file currently open.

long St7GetNumSRACases(long uID, long* NumCases)
Input Parameters
uID
Strand7 model file ID.
Output Parameters
NumCases
Number of cases.
Applicability
Applicable to stSpectralResponse.